//Данное сообщение в конслои будет сообщать какую-либо информацию
console.log("Простая запись в консоль");
//Данное сообщение в конслои будет сообщать об ошибке
console.error("Запись об ошибке");
//Данное сообщение в конслои будет сообщать предупреждение
console.warn("Запись с предупреждением");

//Создание счётчика
let clickCount = 0;
//Создания обработчика события для класса .button
document.querySelector('.button').addEventListener('click', () => {
    //Инкрементирование счётчика
    clickCount++;
    //Вывод колич ества нажатий в консоль
    console.log("Кнопка нажата ", clickCount, " раз")
});

//Цикл для перебора чисел от 0 до 100
for (let i = 0; i <= 100; i++){
    console.log(i);
}
